export const JOB_CODE = {
    0: {
        0: '00',
        1: '01',
        2: '02',
        3: '03',
        4: '04'
    },
    1: {
        0: '10',
        1: '11',
        2: '12',
        3: '13',
        4: '14'
    },
    2: {
        0: '20',
        1: '21',
        2: '22',
        3: '23'
    },
    3: {
        0: '30',
        1: '31',
        2: '32',
        3: '33'
    },
    4: {
        0: '40',
        1: '41',
        2: '42',
        3: '43',
        4: '44'
    },
    5: {
        0: '50',
        1: '51',
        2: '52',
        3: '53',
    },
    6: {
        0: '60',
        1: '61',
        2: '62',
        3: '63',
        4: '64'
    },
    7: {
        0: '70',
        1: '71',
        2: '72',
        3: '73',
        4: '74'
    },
    8: {
        0: '80',
        1: '81',
        2: '82',
        3: '83'
    },
    9: {
        0: '90',
        1: '91',
        2: '92',
        3: '93'
    },
    10: {
        0: '100',
        1: '101',
        2: '102',
        3: '103'
    },
    11: {
        0: '110',
        1: '111',
        2: '112',
        3: '113'
    },
    12: {
        0: '120',
        1: '121',
        2: '122',
        3: '123'
    },
    13: {
        0: '130',
        1: '131',
        2: '132',
        3: '133'
    },
    14: {
        0: '140',
        1: '141'
    },
    15: { 0: '150' },
    16: { 0: '160' }
}

export const JOB = {
    [JOB_CODE[0][0]]: '웨펀마스터',
    [JOB_CODE[0][1]]: '소울브링어',
    [JOB_CODE[0][2]]: '버서커',
    [JOB_CODE[0][3]]: '아수라',
    [JOB_CODE[0][4]]: '검귀',
    [JOB_CODE[1][0]]: '소드마스터',
    [JOB_CODE[1][1]]: '데몬슬레이어',
    [JOB_CODE[1][2]]: '베가본드',
    [JOB_CODE[1][3]]: '다크템플러',
    [JOB_CODE[1][4]]: '블레이드',
    [JOB_CODE[2][0]]: '넨마스터(남)',
    [JOB_CODE[2][1]]: '스트라이커(남)',
    [JOB_CODE[2][2]]: '스트리트파이터(남)',
    [JOB_CODE[2][3]]: '그래플러(남)',
    [JOB_CODE[3][0]]: '넨마스터(여)',
    [JOB_CODE[3][1]]: '스트라이커(여)',
    [JOB_CODE[3][2]]: '스트리트파이터(여)',
    [JOB_CODE[3][3]]: '그래플러(여)',
    [JOB_CODE[4][0]]: '레인저(남)',
    [JOB_CODE[4][1]]: '런처(남)',
    [JOB_CODE[4][2]]: '메카닉(남)',
    [JOB_CODE[4][3]]: '스핏파이어(남)',
    [JOB_CODE[4][4]]: '어썰트',
    [JOB_CODE[5][0]]: '레인저(여)',
    [JOB_CODE[5][0]]: '런처(여)',
    [JOB_CODE[5][0]]: '메카닉(여)',
    [JOB_CODE[5][0]]: '스핏파이어(여)',
    [JOB_CODE[6][0]]: '엘리멘탈 바머',
    [JOB_CODE[6][1]]: '빙결사',
    [JOB_CODE[6][2]]: '블러드 메이지',
    [JOB_CODE[6][3]]: '스위프트 마스터',
    [JOB_CODE[6][4]]: '디멘션워커',
    [JOB_CODE[7][0]]: '엘리멘탈마스터',
    [JOB_CODE[7][1]]: '소환사',
    [JOB_CODE[7][2]]: '배틀메이지',
    [JOB_CODE[7][3]]: '마도학자',
    [JOB_CODE[7][4]]: '인챈트리스',
    [JOB_CODE[8][0]]: '크루세이더(남)',
    [JOB_CODE[8][1]]: '인파이터',
    [JOB_CODE[8][2]]: '퇴마사',
    [JOB_CODE[8][3]]: '어벤저',
    [JOB_CODE[9][0]]: '크루세이더(여)',
    [JOB_CODE[9][1]]: '이단심판관',
    [JOB_CODE[9][2]]: '무녀',
    [JOB_CODE[9][3]]: '미스트리스',
    [JOB_CODE[10][0]]: '로그',
    [JOB_CODE[10][1]]: '사령술사',
    [JOB_CODE[10][2]]: '쿠노이치',
    [JOB_CODE[10][3]]: '섀도우댄서',
    [JOB_CODE[11][0]]: '엘븐나이트',
    [JOB_CODE[11][1]]: '카오스',
    [JOB_CODE[11][2]]: '팔라딘',
    [JOB_CODE[11][3]]: '드래곤나이트',
    [JOB_CODE[12][0]]: '뱅가드',
    [JOB_CODE[12][1]]: '듀얼리스트',
    [JOB_CODE[12][2]]: '드래고니안 랜서',
    [JOB_CODE[12][3]]: '다크 랜서',
    [JOB_CODE[13][0]]: '요원',
    [JOB_CODE[13][1]]: '트러블 슈터',
    [JOB_CODE[13][2]]: '히트맨',
    [JOB_CODE[13][3]]: '스페셜리스트',
    [JOB_CODE[14][0]]: '뮤즈',
    [JOB_CODE[14][1]]: '트래블러',
    [JOB_CODE[15][0]]: '다크나이트',
    [JOB_CODE[16][0]]: '크리에이터',
}